apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_exti_m33_v1.h
/* EXTI rising trigger selection register 1 */

#define EXTI_RTSR1_RT0             STM32_EXTI_BIT(0)
#define EXTI_RTSR1_RT1             STM32_EXTI_BIT(1)
#define EXTI_RTSR1_RT2             STM32_EXTI_BIT(2)
#define EXTI_RTSR1_RT3             STM32_EXTI_BIT(3)
#define EXTI_RTSR1_RT4             STM32_EXTI_BIT(4)
#define EXTI_RTSR1_RT5             STM32_EXTI_BIT(5)
#define EXTI_RTSR1_RT6             STM32_EXTI_BIT(6)
#define EXTI_RTSR1_RT7             STM32_EXTI_BIT(7)
#define EXTI_RTSR1_RT8             STM32_EXTI_BIT(8)
#define EXTI_RTSR1_RT9             STM32_EXTI_BIT(9)
#define EXTI_RTSR1_RT10            STM32_EXTI_BIT(10)
#define EXTI_RTSR1_RT11            STM32_EXTI_BIT(11)
#define EXTI_RTSR1_RT12            STM32_EXTI_BIT(12)
#define EXTI_RTSR1_RT13            STM32_EXTI_BIT(13)
#define EXTI_RTSR1_RT14            STM32_EXTI_BIT(14)
#define EXTI_RTSR1_RT15            STM32_EXTI_BIT(15)
#define EXTI_RTSR1_RT16            STM32_EXTI_BIT(16)
#define EXTI_RTSR1_RT17            STM32_EXTI_BIT(17)
#define EXTI_RTSR1_RT18            STM32_EXTI_BIT(18)
#define EXTI_RTSR1_RT19            STM32_EXTI_BIT(19)
#define EXTI_RTSR1_RT20            STM32_EXTI_BIT(20)
#define EXTI_RTSR1_RT21            STM32_EXTI_BIT(21)
#define EXTI_RTSR1_RT22            STM32_EXTI_BIT(22)
#define EXTI_RTSR1_RT23            STM32_EXTI_BIT(23)
#define EXTI_RTSR1_RT24            STM32_EXTI_BIT(24)
#define EXTI_RTSR1_RT25            STM32_EXTI_BIT(25)
#define EXTI_RTSR1_RT26            STM32_EXTI_BIT(26)
#define EXTI_RTSR1_RT27            STM32_EXTI_BIT(27)
#define EXTI_RTSR1_RT28            STM32_EXTI_BIT(28)
#define EXTI_RTSR1_RT29            STM32_EXTI_BIT(29)
#define EXTI_RTSR1_RT30            STM32_EXTI_BIT(30)
#define EXTI_RTSR1_RT31            STM32_EXTI_BIT(31)

/* EXTI rising trigger selection register 2 */

#define EXTI_RTSR2_RT32            STM32_EXTI_BIT(32)
#define EXTI_RTSR2_RT33            STM32_EXTI_BIT(33)
#define EXTI_RTSR2_RT34            STM32_EXTI_BIT(34)
#define EXTI_RTSR2_RT35            STM32_EXTI_BIT(35)
#define EXTI_RTSR2_RT36            STM32_EXTI_BIT(36)
#define EXTI_RTSR2_RT37            STM32_EXTI_BIT(37)
#define EXTI_RTSR2_RT38            STM32_EXTI_BIT(38)
#define EXTI_RTSR2_RT39            STM32_EXTI_BIT(39)
#define EXTI_RTSR2_RT40            STM32_EXTI_BIT(40)
#define EXTI_RTSR2_RT41            STM32_EXTI_BIT(41)
#define EXTI_RTSR2_RT42            STM32_EXTI_BIT(42)
#define EXTI_RTSR2_RT43            STM32_EXTI_BIT(43)
#define EXTI_RTSR2_RT44            STM32_EXTI_BIT(44)
#define EXTI_RTSR2_RT45            STM32_EXTI_BIT(45)
#define EXTI_RTSR2_RT46            STM32_EXTI_BIT(46)
#define EXTI_RTSR2_RT47            STM32_EXTI_BIT(47)
#define EXTI_RTSR2_RT48            STM32_EXTI_BIT(48)
#define EXTI_RTSR2_RT49            STM32_EXTI_BIT(49)
#define EXTI_RTSR2_RT50            STM32_EXTI_BIT(50)
#define EXTI_RTSR2_RT51            STM32_EXTI_BIT(51)
#define EXTI_RTSR2_RT52            STM32_EXTI_BIT(52)
#define EXTI_RTSR2_RT53            STM32_EXTI_BIT(53)
#define EXTI_RTSR2_RT54            STM32_EXTI_BIT(54)
#define EXTI_RTSR2_RT55            STM32_EXTI_BIT(55)
#define EXTI_RTSR2_RT56            STM32_EXTI_BIT(56)
#define EXTI_RTSR2_RT57            STM32_EXTI_BIT(57)
#define EXTI_RTSR2_RT58            STM32_EXTI_BIT(58)
#define EXTI_RTSR2_RT59            STM32_EXTI_BIT(59)
#define EXTI_RTSR2_RT60            STM32_EXTI_BIT(60)
#define EXTI_RTSR2_RT61            STM32_EXTI_BIT(61)
#define EXTI_RTSR2_RT62            STM32_EXTI_BIT(62)
#define EXTI_RTSR2_RT63            STM32_EXTI_BIT(63)

/* EXTI falling trigger selection register 1 */

#define EXTI_FTSR1_FT0             STM32_EXTI_BIT(0)
#define EXTI_FTSR1_FT1             STM32_EXTI_BIT(1)
#define EXTI_FTSR1_FT2             STM32_EXTI_BIT(2)
#define EXTI_FTSR1_FT3             STM32_EXTI_BIT(3)
#define EXTI_FTSR1_FT4             STM32_EXTI_BIT(4)
#define EXTI_FTSR1_FT5             STM32_EXTI_BIT(5)
#define EXTI_FTSR1_FT6             STM32_EXTI_BIT(6)
#define EXTI_FTSR1_FT7             STM32_EXTI_BIT(7)
#define EXTI_FTSR1_FT8             STM32_EXTI_BIT(8)
#define EXTI_FTSR1_FT9             STM32_EXTI_BIT(9)
#define EXTI_FTSR1_FT10            STM32_EXTI_BIT(10)
#define EXTI_FTSR1_FT11            STM32_EXTI_BIT(11)
#define EXTI_FTSR1_FT12            STM32_EXTI_BIT(12)
#define EXTI_FTSR1_FT13            STM32_EXTI_BIT(13)
#define EXTI_FTSR1_FT14            STM32_EXTI_BIT(14)
#define EXTI_FTSR1_FT15            STM32_EXTI_BIT(15)
#define EXTI_FTSR1_FT16            STM32_EXTI_BIT(16)
#define EXTI_FTSR1_FT17            STM32_EXTI_BIT(17)
#define EXTI_FTSR1_FT18            STM32_EXTI_BIT(18)
#define EXTI_FTSR1_FT19            STM32_EXTI_BIT(19)
#define EXTI_FTSR1_FT20            STM32_EXTI_BIT(20)
#define EXTI_FTSR1_FT21            STM32_EXTI_BIT(21)
#define EXTI_FTSR1_FT22            STM32_EXTI_BIT(22)
#define EXTI_FTSR1_FT23            STM32_EXTI_BIT(23)
#define EXTI_FTSR1_FT24            STM32_EXTI_BIT(24)
#define EXTI_FTSR1_FT25            STM32_EXTI_BIT(25)
#define EXTI_FTSR1_FT26            STM32_EXTI_BIT(26)
#define EXTI_FTSR1_FT27            STM32_EXTI_BIT(27)
#define EXTI_FTSR1_FT28            STM32_EXTI_BIT(28)
#define EXTI_FTSR1_FT29            STM32_EXTI_BIT(29)
#define EXTI_FTSR1_FT30            STM32_EXTI_BIT(30)
#define EXTI_FTSR1_FT31            STM32_EXTI_BIT(31)

/* EXTI falling trigger selection register 2 */

#define EXTI_FTSR2_FT32            STM32_EXTI_BIT(32)
#define EXTI_FTSR2_FT33            STM32_EXTI_BIT(33)
#define EXTI_FTSR2_FT34            STM32_EXTI_BIT(34)
#define EXTI_FTSR2_FT35            STM32_EXTI_BIT(35)
#define EXTI_FTSR2_FT36            STM32_EXTI_BIT(36)
#define EXTI_FTSR2_FT37            STM32_EXTI_BIT(37)
#define EXTI_FTSR2_FT38            STM32_EXTI_BIT(38)
#define EXTI_FTSR2_FT39            STM32_EXTI_BIT(39)
#define EXTI_FTSR2_FT40            STM32_EXTI_BIT(40)
#define EXTI_FTSR2_FT41            STM32_EXTI_BIT(41)
#define EXTI_FTSR2_FT42            STM32_EXTI_BIT(42)
#define EXTI_FTSR2_FT43            STM32_EXTI_BIT(43)
#define EXTI_FTSR2_FT44            STM32_EXTI_BIT(44)
#define EXTI_FTSR2_FT45            STM32_EXTI_BIT(45)
#define EXTI_FTSR2_FT46            STM32_EXTI_BIT(46)
#define EXTI_FTSR2_FT47            STM32_EXTI_BIT(47)
#define EXTI_FTSR2_FT48            STM32_EXTI_BIT(48)
#define EXTI_FTSR2_FT49            STM32_EXTI_BIT(49)
#define EXTI_FTSR2_FT50            STM32_EXTI_BIT(50)
#define EXTI_FTSR2_FT51            STM32_EXTI_BIT(51)
#define EXTI_FTSR2_FT52            STM32_EXTI_BIT(52)
#define EXTI_FTSR2_FT53            STM32_EXTI_BIT(53)
#define EXTI_FTSR2_FT54            STM32_EXTI_BIT(54)
#define EXTI_FTSR2_FT55            STM32_EXTI_BIT(55)
#define EXTI_FTSR2_FT56            STM32_EXTI_BIT(56)
#define EXTI_FTSR2_FT57            STM32_EXTI_BIT(57)
#define EXTI_FTSR2_FT58            STM32_EXTI_BIT(58)
#define EXTI_FTSR2_FT59            STM32_EXTI_BIT(59)
#define EXTI_FTSR2_FT60            STM32_EXTI_BIT(60)
#define EXTI_FTSR2_FT61            STM32_EXTI_BIT(61)
#define EXTI_FTSR2_FT62            STM32_EXTI_BIT(62)
#define EXTI_FTSR2_FT63            STM32_EXTI_BIT(63)

/* EXTI software interrupt event register 1 */

#define EXTI_SWIER1_SWI0           STM32_EXTI_BIT(0)
#define EXTI_SWIER1_SWI1           STM32_EXTI_BIT(1)
#define EXTI_SWIER1_SWI2           STM32_EXTI_BIT(2)
#define EXTI_SWIER1_SWI3           STM32_EXTI_BIT(3)
#define EXTI_SWIER1_SWI4           STM32_EXTI_BIT(4)
#define EXTI_SWIER1_SWI5           STM32_EXTI_BIT(5)
#define EXTI_SWIER1_SWI6           STM32_EXTI_BIT(6)
#define EXTI_SWIER1_SWI7           STM32_EXTI_BIT(7)
#define EXTI_SWIER1_SWI8           STM32_EXTI_BIT(8)
#define EXTI_SWIER1_SWI9           STM32_EXTI_BIT(9)
#define EXTI_SWIER1_SWI10          STM32_EXTI_BIT(10)
#define EXTI_SWIER1_SWI11          STM32_EXTI_BIT(11)
#define EXTI_SWIER1_SWI12          STM32_EXTI_BIT(12)
#define EXTI_SWIER1_SWI13          STM32_EXTI_BIT(13)
#define EXTI_SWIER1_SWI14          STM32_EXTI_BIT(14)
#define EXTI_SWIER1_SWI15          STM32_EXTI_BIT(15)
#define EXTI_SWIER1_SWI16          STM32_EXTI_BIT(16)
#define EXTI_SWIER1_SWI17          STM32_EXTI_BIT(17)
#define EXTI_SWIER1_SWI18          STM32_EXTI_BIT(18)
#define EXTI_SWIER1_SWI19          STM32_EXTI_BIT(19)
#define EXTI_SWIER1_SWI20          STM32_EXTI_BIT(20)
#define EXTI_SWIER1_SWI21          STM32_EXTI_BIT(21)
#define EXTI_SWIER1_SWI22          STM32_EXTI_BIT(22)
#define EXTI_SWIER1_SWI23          STM32_EXTI_BIT(23)
#define EXTI_SWIER1_SWI24          STM32_EXTI_BIT(24)
#define EXTI_SWIER1_SWI25          STM32_EXTI_BIT(25)
#define EXTI_SWIER1_SWI26          STM32_EXTI_BIT(26)
#define EXTI_SWIER1_SWI27          STM32_EXTI_BIT(27)
#define EXTI_SWIER1_SWI28          STM32_EXTI_BIT(28)
#define EXTI_SWIER1_SWI29          STM32_EXTI_BIT(29)
#define EXTI_SWIER1_SWI30          STM32_EXTI_BIT(30)
#define EXTI_SWIER1_SWI31          STM32_EXTI_BIT(31)

/* EXTI software interrupt event register 2 */

#define EXTI_SWIER2_SWI32          STM32_EXTI_BIT(32)
#define EXTI_SWIER2_SWI33          STM32_EXTI_BIT(33)
#define EXTI_SWIER2_SWI34          STM32_EXTI_BIT(34)
#define EXTI_SWIER2_SWI35          STM32_EXTI_BIT(35)
#define EXTI_SWIER2_SWI36          STM32_EXTI_BIT(36)
#define EXTI_SWIER2_SWI37          STM32_EXTI_BIT(37)
#define EXTI_SWIER2_SWI38          STM32_EXTI_BIT(38)
#define EXTI_SWIER2_SWI39          STM32_EXTI_BIT(39)
#define EXTI_SWIER2_SWI40          STM32_EXTI_BIT(40)
#define EXTI_SWIER2_SWI41          STM32_EXTI_BIT(41)
#define EXTI_SWIER2_SWI42          STM32_EXTI_BIT(42)
#define EXTI_SWIER2_SWI43          STM32_EXTI_BIT(43)
#define EXTI_SWIER2_SWI44          STM32_EXTI_BIT(44)
#define EXTI_SWIER2_SWI45          STM32_EXTI_BIT(45)
#define EXTI_SWIER2_SWI46          STM32_EXTI_BIT(46)
#define EXTI_SWIER2_SWI47          STM32_EXTI_BIT(47)
#define EXTI_SWIER2_SWI48          STM32_EXTI_BIT(48)
#define EXTI_SWIER2_SWI49          STM32_EXTI_BIT(49)
#define EXTI_SWIER2_SWI50          STM32_EXTI_BIT(50)
#define EXTI_SWIER2_SWI51          STM32_EXTI_BIT(51)
#define EXTI_SWIER2_SWI52          STM32_EXTI_BIT(52)
#define EXTI_SWIER2_SWI53          STM32_EXTI_BIT(53)
#define EXTI_SWIER2_SWI54          STM32_EXTI_BIT(54)
#define EXTI_SWIER2_SWI55          STM32_EXTI_BIT(55)
#define EXTI_SWIER2_SWI56          STM32_EXTI_BIT(56)
#define EXTI_SWIER2_SWI57          STM32_EXTI_BIT(57)
#define EXTI_SWIER2_SWI58          STM32_EXTI_BIT(58)
#define EXTI_SWIER2_SWI59          STM32_EXTI_BIT(59)
#define EXTI_SWIER2_SWI60          STM32_EXTI_BIT(60)
#define EXTI_SWIER2_SWI61          STM32_EXTI_BIT(61)
#define EXTI_SWIER2_SWI62          STM32_EXTI_BIT(62)
#define EXTI_SWIER2_SWI63          STM32_EXTI_BIT(63)

