apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_exti_m33_v1.h
/* EXTI rising edge pending register 1 */

#define EXTI_RPR1_RPIF0            STM32_EXTI_BIT(0)
#define EXTI_RPR1_RPIF1            STM32_EXTI_BIT(1)
#define EXTI_RPR1_RPIF2            STM32_EXTI_BIT(2)
#define EXTI_RPR1_RPIF3            STM32_EXTI_BIT(3)
#define EXTI_RPR1_RPIF4            STM32_EXTI_BIT(4)
#define EXTI_RPR1_RPIF5            STM32_EXTI_BIT(5)
#define EXTI_RPR1_RPIF6            STM32_EXTI_BIT(6)
#define EXTI_RPR1_RPIF7            STM32_EXTI_BIT(7)
#define EXTI_RPR1_RPIF8            STM32_EXTI_BIT(8)
#define EXTI_RPR1_RPIF9            STM32_EXTI_BIT(9)
#define EXTI_RPR1_RPIF10           STM32_EXTI_BIT(10)
#define EXTI_RPR1_RPIF11           STM32_EXTI_BIT(11)
#define EXTI_RPR1_RPIF12           STM32_EXTI_BIT(12)
#define EXTI_RPR1_RPIF13           STM32_EXTI_BIT(13)
#define EXTI_RPR1_RPIF14           STM32_EXTI_BIT(14)
#define EXTI_RPR1_RPIF15           STM32_EXTI_BIT(15)
#define EXTI_RPR1_RPIF16           STM32_EXTI_BIT(16)
#define EXTI_RPR1_RPIF17           STM32_EXTI_BIT(17)
#define EXTI_RPR1_RPIF18           STM32_EXTI_BIT(18)
#define EXTI_RPR1_RPIF19           STM32_EXTI_BIT(19)
#define EXTI_RPR1_RPIF20           STM32_EXTI_BIT(20)
#define EXTI_RPR1_RPIF21           STM32_EXTI_BIT(21)
#define EXTI_RPR1_RPIF22           STM32_EXTI_BIT(22)
#define EXTI_RPR1_RPIF23           STM32_EXTI_BIT(23)
#define EXTI_RPR1_RPIF24           STM32_EXTI_BIT(24)
#define EXTI_RPR1_RPIF25           STM32_EXTI_BIT(25)
#define EXTI_RPR1_RPIF26           STM32_EXTI_BIT(26)
#define EXTI_RPR1_RPIF27           STM32_EXTI_BIT(27)
#define EXTI_RPR1_RPIF28           STM32_EXTI_BIT(28)
#define EXTI_RPR1_RPIF29           STM32_EXTI_BIT(29)
#define EXTI_RPR1_RPIF30           STM32_EXTI_BIT(30)
#define EXTI_RPR1_RPIF31           STM32_EXTI_BIT(31)

/* EXTI rising edge pending register 2 */

#define EXTI_RPR2_RPIF32           STM32_EXTI_BIT(32)
#define EXTI_RPR2_RPIF33           STM32_EXTI_BIT(33)
#define EXTI_RPR2_RPIF34           STM32_EXTI_BIT(34)
#define EXTI_RPR2_RPIF35           STM32_EXTI_BIT(35)
#define EXTI_RPR2_RPIF36           STM32_EXTI_BIT(36)
#define EXTI_RPR2_RPIF37           STM32_EXTI_BIT(37)
#define EXTI_RPR2_RPIF38           STM32_EXTI_BIT(38)
#define EXTI_RPR2_RPIF39           STM32_EXTI_BIT(39)
#define EXTI_RPR2_RPIF40           STM32_EXTI_BIT(40)
#define EXTI_RPR2_RPIF41           STM32_EXTI_BIT(41)
#define EXTI_RPR2_RPIF42           STM32_EXTI_BIT(42)
#define EXTI_RPR2_RPIF43           STM32_EXTI_BIT(43)
#define EXTI_RPR2_RPIF44           STM32_EXTI_BIT(44)
#define EXTI_RPR2_RPIF45           STM32_EXTI_BIT(45)
#define EXTI_RPR2_RPIF46           STM32_EXTI_BIT(46)
#define EXTI_RPR2_RPIF47           STM32_EXTI_BIT(47)
#define EXTI_RPR2_RPIF48           STM32_EXTI_BIT(48)
#define EXTI_RPR2_RPIF49           STM32_EXTI_BIT(49)
#define EXTI_RPR2_RPIF50           STM32_EXTI_BIT(50)
#define EXTI_RPR2_RPIF51           STM32_EXTI_BIT(51)
#define EXTI_RPR2_RPIF52           STM32_EXTI_BIT(52)
#define EXTI_RPR2_RPIF53           STM32_EXTI_BIT(53)
#define EXTI_RPR2_RPIF54           STM32_EXTI_BIT(54)
#define EXTI_RPR2_RPIF55           STM32_EXTI_BIT(55)
#define EXTI_RPR2_RPIF56           STM32_EXTI_BIT(56)
#define EXTI_RPR2_RPIF57           STM32_EXTI_BIT(57)
#define EXTI_RPR2_RPIF58           STM32_EXTI_BIT(58)
#define EXTI_RPR2_RPIF59           STM32_EXTI_BIT(59)
#define EXTI_RPR2_RPIF60           STM32_EXTI_BIT(60)
#define EXTI_RPR2_RPIF61           STM32_EXTI_BIT(61)
#define EXTI_RPR2_RPIF62           STM32_EXTI_BIT(62)
#define EXTI_RPR2_RPIF63           STM32_EXTI_BIT(63)

/* EXTI falling edge pending register 1 */

#define EXTI_FPR1_FPIF0            STM32_EXTI_BIT(0)
#define EXTI_FPR1_FPIF1            STM32_EXTI_BIT(1)
#define EXTI_FPR1_FPIF2            STM32_EXTI_BIT(2)
#define EXTI_FPR1_FPIF3            STM32_EXTI_BIT(3)
#define EXTI_FPR1_FPIF4            STM32_EXTI_BIT(4)
#define EXTI_FPR1_FPIF5            STM32_EXTI_BIT(5)
#define EXTI_FPR1_FPIF6            STM32_EXTI_BIT(6)
#define EXTI_FPR1_FPIF7            STM32_EXTI_BIT(7)
#define EXTI_FPR1_FPIF8            STM32_EXTI_BIT(8)
#define EXTI_FPR1_FPIF9            STM32_EXTI_BIT(9)
#define EXTI_FPR1_FPIF10           STM32_EXTI_BIT(10)
#define EXTI_FPR1_FPIF11           STM32_EXTI_BIT(11)
#define EXTI_FPR1_FPIF12           STM32_EXTI_BIT(12)
#define EXTI_FPR1_FPIF13           STM32_EXTI_BIT(13)
#define EXTI_FPR1_FPIF14           STM32_EXTI_BIT(14)
#define EXTI_FPR1_FPIF15           STM32_EXTI_BIT(15)
#define EXTI_FPR1_FPIF16           STM32_EXTI_BIT(16)
#define EXTI_FPR1_FPIF17           STM32_EXTI_BIT(17)
#define EXTI_FPR1_FPIF18           STM32_EXTI_BIT(18)
#define EXTI_FPR1_FPIF19           STM32_EXTI_BIT(19)
#define EXTI_FPR1_FPIF20           STM32_EXTI_BIT(20)
#define EXTI_FPR1_FPIF21           STM32_EXTI_BIT(21)
#define EXTI_FPR1_FPIF22           STM32_EXTI_BIT(22)
#define EXTI_FPR1_FPIF23           STM32_EXTI_BIT(23)
#define EXTI_FPR1_FPIF24           STM32_EXTI_BIT(24)
#define EXTI_FPR1_FPIF25           STM32_EXTI_BIT(25)
#define EXTI_FPR1_FPIF26           STM32_EXTI_BIT(26)
#define EXTI_FPR1_FPIF27           STM32_EXTI_BIT(27)
#define EXTI_FPR1_FPIF28           STM32_EXTI_BIT(28)
#define EXTI_FPR1_FPIF29           STM32_EXTI_BIT(29)
#define EXTI_FPR1_FPIF30           STM32_EXTI_BIT(30)
#define EXTI_FPR1_FPIF31           STM32_EXTI_BIT(31)

/* EXTI falling edge pending register 2 */

#define EXTI_FPR2_FPIF32           STM32_EXTI_BIT(32)
#define EXTI_FPR2_FPIF33           STM32_EXTI_BIT(33)
#define EXTI_FPR2_FPIF34           STM32_EXTI_BIT(34)
#define EXTI_FPR2_FPIF35           STM32_EXTI_BIT(35)
#define EXTI_FPR2_FPIF36           STM32_EXTI_BIT(36)
#define EXTI_FPR2_FPIF37           STM32_EXTI_BIT(37)
#define EXTI_FPR2_FPIF38           STM32_EXTI_BIT(38)
#define EXTI_FPR2_FPIF39           STM32_EXTI_BIT(39)
#define EXTI_FPR2_FPIF40           STM32_EXTI_BIT(40)
#define EXTI_FPR2_FPIF41           STM32_EXTI_BIT(41)
#define EXTI_FPR2_FPIF42           STM32_EXTI_BIT(42)
#define EXTI_FPR2_FPIF43           STM32_EXTI_BIT(43)
#define EXTI_FPR2_FPIF44           STM32_EXTI_BIT(44)
#define EXTI_FPR2_FPIF45           STM32_EXTI_BIT(45)
#define EXTI_FPR2_FPIF46           STM32_EXTI_BIT(46)
#define EXTI_FPR2_FPIF47           STM32_EXTI_BIT(47)
#define EXTI_FPR2_FPIF48           STM32_EXTI_BIT(48)
#define EXTI_FPR2_FPIF49           STM32_EXTI_BIT(49)
#define EXTI_FPR2_FPIF50           STM32_EXTI_BIT(50)
#define EXTI_FPR2_FPIF51           STM32_EXTI_BIT(51)
#define EXTI_FPR2_FPIF52           STM32_EXTI_BIT(52)
#define EXTI_FPR2_FPIF53           STM32_EXTI_BIT(53)
#define EXTI_FPR2_FPIF54           STM32_EXTI_BIT(54)
#define EXTI_FPR2_FPIF55           STM32_EXTI_BIT(55)
#define EXTI_FPR2_FPIF56           STM32_EXTI_BIT(56)
#define EXTI_FPR2_FPIF57           STM32_EXTI_BIT(57)
#define EXTI_FPR2_FPIF58           STM32_EXTI_BIT(58)
#define EXTI_FPR2_FPIF59           STM32_EXTI_BIT(59)
#define EXTI_FPR2_FPIF60           STM32_EXTI_BIT(60)
#define EXTI_FPR2_FPIF61           STM32_EXTI_BIT(61)
#define EXTI_FPR2_FPIF62           STM32_EXTI_BIT(62)
#define EXTI_FPR2_FPIF63           STM32_EXTI_BIT(63)

/* EXTI security configuration register 1 */

