apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_exti_m33_v1.h
#define EXTI_SECCFGR1_SEC0         STM32_EXTI_BIT(0)
#define EXTI_SECCFGR1_SEC1         STM32_EXTI_BIT(1)
#define EXTI_SECCFGR1_SEC2         STM32_EXTI_BIT(2)
#define EXTI_SECCFGR1_SEC3         STM32_EXTI_BIT(3)
#define EXTI_SECCFGR1_SEC4         STM32_EXTI_BIT(4)
#define EXTI_SECCFGR1_SEC5         STM32_EXTI_BIT(5)
#define EXTI_SECCFGR1_SEC6         STM32_EXTI_BIT(6)
#define EXTI_SECCFGR1_SEC7         STM32_EXTI_BIT(7)
#define EXTI_SECCFGR1_SEC8         STM32_EXTI_BIT(8)
#define EXTI_SECCFGR1_SEC9         STM32_EXTI_BIT(9)
#define EXTI_SECCFGR1_SEC10        STM32_EXTI_BIT(10)
#define EXTI_SECCFGR1_SEC11        STM32_EXTI_BIT(11)
#define EXTI_SECCFGR1_SEC12        STM32_EXTI_BIT(12)
#define EXTI_SECCFGR1_SEC13        STM32_EXTI_BIT(13)
#define EXTI_SECCFGR1_SEC14        STM32_EXTI_BIT(14)
#define EXTI_SECCFGR1_SEC15        STM32_EXTI_BIT(15)
#define EXTI_SECCFGR1_SEC16        STM32_EXTI_BIT(16)
#define EXTI_SECCFGR1_SEC17        STM32_EXTI_BIT(17)
#define EXTI_SECCFGR1_SEC18        STM32_EXTI_BIT(18)
#define EXTI_SECCFGR1_SEC19        STM32_EXTI_BIT(19)
#define EXTI_SECCFGR1_SEC20        STM32_EXTI_BIT(20)
#define EXTI_SECCFGR1_SEC21        STM32_EXTI_BIT(21)
#define EXTI_SECCFGR1_SEC22        STM32_EXTI_BIT(22)
#define EXTI_SECCFGR1_SEC23        STM32_EXTI_BIT(23)
#define EXTI_SECCFGR1_SEC24        STM32_EXTI_BIT(24)
#define EXTI_SECCFGR1_SEC25        STM32_EXTI_BIT(25)
#define EXTI_SECCFGR1_SEC26        STM32_EXTI_BIT(26)
#define EXTI_SECCFGR1_SEC27        STM32_EXTI_BIT(27)
#define EXTI_SECCFGR1_SEC28        STM32_EXTI_BIT(28)
#define EXTI_SECCFGR1_SEC29        STM32_EXTI_BIT(29)
#define EXTI_SECCFGR1_SEC30        STM32_EXTI_BIT(30)
#define EXTI_SECCFGR1_SEC31        STM32_EXTI_BIT(31)

/* EXTI security configuration register 2 */

#define EXTI_SECCFGR2_SEC32        STM32_EXTI_BIT(32)
#define EXTI_SECCFGR2_SEC33        STM32_EXTI_BIT(33)
#define EXTI_SECCFGR2_SEC34        STM32_EXTI_BIT(34)
#define EXTI_SECCFGR2_SEC35        STM32_EXTI_BIT(35)
#define EXTI_SECCFGR2_SEC36        STM32_EXTI_BIT(36)
#define EXTI_SECCFGR2_SEC37        STM32_EXTI_BIT(37)
#define EXTI_SECCFGR2_SEC38        STM32_EXTI_BIT(38)
#define EXTI_SECCFGR2_SEC39        STM32_EXTI_BIT(39)
#define EXTI_SECCFGR2_SEC40        STM32_EXTI_BIT(40)
#define EXTI_SECCFGR2_SEC41        STM32_EXTI_BIT(41)
#define EXTI_SECCFGR2_SEC42        STM32_EXTI_BIT(42)
#define EXTI_SECCFGR2_SEC43        STM32_EXTI_BIT(43)
#define EXTI_SECCFGR2_SEC44        STM32_EXTI_BIT(44)
#define EXTI_SECCFGR2_SEC45        STM32_EXTI_BIT(45)
#define EXTI_SECCFGR2_SEC46        STM32_EXTI_BIT(46)
#define EXTI_SECCFGR2_SEC47        STM32_EXTI_BIT(47)
#define EXTI_SECCFGR2_SEC48        STM32_EXTI_BIT(48)
#define EXTI_SECCFGR2_SEC49        STM32_EXTI_BIT(49)
#define EXTI_SECCFGR2_SEC50        STM32_EXTI_BIT(50)
#define EXTI_SECCFGR2_SEC51        STM32_EXTI_BIT(51)
#define EXTI_SECCFGR2_SEC52        STM32_EXTI_BIT(52)
#define EXTI_SECCFGR2_SEC53        STM32_EXTI_BIT(53)
#define EXTI_SECCFGR2_SEC54        STM32_EXTI_BIT(54)
#define EXTI_SECCFGR2_SEC55        STM32_EXTI_BIT(55)
#define EXTI_SECCFGR2_SEC56        STM32_EXTI_BIT(56)
#define EXTI_SECCFGR2_SEC57        STM32_EXTI_BIT(57)
#define EXTI_SECCFGR2_SEC58        STM32_EXTI_BIT(58)
#define EXTI_SECCFGR2_SEC59        STM32_EXTI_BIT(59)
#define EXTI_SECCFGR2_SEC60        STM32_EXTI_BIT(60)
#define EXTI_SECCFGR2_SEC61        STM32_EXTI_BIT(61)
#define EXTI_SECCFGR2_SEC62        STM32_EXTI_BIT(62)
#define EXTI_SECCFGR2_SEC63        STM32_EXTI_BIT(63)

/* EXTI privilege configuration register 1 */

#define EXTI_PRIVCFGR1_PRIV0       STM32_EXTI_BIT(0)
#define EXTI_PRIVCFGR1_PRIV1       STM32_EXTI_BIT(1)
#define EXTI_PRIVCFGR1_PRIV2       STM32_EXTI_BIT(2)
#define EXTI_PRIVCFGR1_PRIV3       STM32_EXTI_BIT(3)
#define EXTI_PRIVCFGR1_PRIV4       STM32_EXTI_BIT(4)
#define EXTI_PRIVCFGR1_PRIV5       STM32_EXTI_BIT(5)
#define EXTI_PRIVCFGR1_PRIV6       STM32_EXTI_BIT(6)
#define EXTI_PRIVCFGR1_PRIV7       STM32_EXTI_BIT(7)
#define EXTI_PRIVCFGR1_PRIV8       STM32_EXTI_BIT(8)
#define EXTI_PRIVCFGR1_PRIV9       STM32_EXTI_BIT(9)
#define EXTI_PRIVCFGR1_PRIV10      STM32_EXTI_BIT(10)
#define EXTI_PRIVCFGR1_PRIV11      STM32_EXTI_BIT(11)
#define EXTI_PRIVCFGR1_PRIV12      STM32_EXTI_BIT(12)
#define EXTI_PRIVCFGR1_PRIV13      STM32_EXTI_BIT(13)
#define EXTI_PRIVCFGR1_PRIV14      STM32_EXTI_BIT(14)
#define EXTI_PRIVCFGR1_PRIV15      STM32_EXTI_BIT(15)
#define EXTI_PRIVCFGR1_PRIV16      STM32_EXTI_BIT(16)
#define EXTI_PRIVCFGR1_PRIV17      STM32_EXTI_BIT(17)
#define EXTI_PRIVCFGR1_PRIV18      STM32_EXTI_BIT(18)
#define EXTI_PRIVCFGR1_PRIV19      STM32_EXTI_BIT(19)
#define EXTI_PRIVCFGR1_PRIV20      STM32_EXTI_BIT(20)
#define EXTI_PRIVCFGR1_PRIV21      STM32_EXTI_BIT(21)
#define EXTI_PRIVCFGR1_PRIV22      STM32_EXTI_BIT(22)
#define EXTI_PRIVCFGR1_PRIV23      STM32_EXTI_BIT(23)
#define EXTI_PRIVCFGR1_PRIV24      STM32_EXTI_BIT(24)
#define EXTI_PRIVCFGR1_PRIV25      STM32_EXTI_BIT(25)
#define EXTI_PRIVCFGR1_PRIV26      STM32_EXTI_BIT(26)
#define EXTI_PRIVCFGR1_PRIV27      STM32_EXTI_BIT(27)
#define EXTI_PRIVCFGR1_PRIV28      STM32_EXTI_BIT(28)
#define EXTI_PRIVCFGR1_PRIV29      STM32_EXTI_BIT(29)
#define EXTI_PRIVCFGR1_PRIV30      STM32_EXTI_BIT(30)
#define EXTI_PRIVCFGR1_PRIV31      STM32_EXTI_BIT(31)

/* EXTI privilege configuration register 2 */

#define EXTI_PRIVCFGR2_PRIV32      STM32_EXTI_BIT(32)
#define EXTI_PRIVCFGR2_PRIV33      STM32_EXTI_BIT(33)
#define EXTI_PRIVCFGR2_PRIV34      STM32_EXTI_BIT(34)
#define EXTI_PRIVCFGR2_PRIV35      STM32_EXTI_BIT(35)
#define EXTI_PRIVCFGR2_PRIV36      STM32_EXTI_BIT(36)
#define EXTI_PRIVCFGR2_PRIV37      STM32_EXTI_BIT(37)
#define EXTI_PRIVCFGR2_PRIV38      STM32_EXTI_BIT(38)
#define EXTI_PRIVCFGR2_PRIV39      STM32_EXTI_BIT(39)
#define EXTI_PRIVCFGR2_PRIV40      STM32_EXTI_BIT(40)
#define EXTI_PRIVCFGR2_PRIV41      STM32_EXTI_BIT(41)
#define EXTI_PRIVCFGR2_PRIV42      STM32_EXTI_BIT(42)
#define EXTI_PRIVCFGR2_PRIV43      STM32_EXTI_BIT(43)
#define EXTI_PRIVCFGR2_PRIV44      STM32_EXTI_BIT(44)
#define EXTI_PRIVCFGR2_PRIV45      STM32_EXTI_BIT(45)
#define EXTI_PRIVCFGR2_PRIV46      STM32_EXTI_BIT(46)
#define EXTI_PRIVCFGR2_PRIV47      STM32_EXTI_BIT(47)
#define EXTI_PRIVCFGR2_PRIV48      STM32_EXTI_BIT(48)
#define EXTI_PRIVCFGR2_PRIV49      STM32_EXTI_BIT(49)
#define EXTI_PRIVCFGR2_PRIV50      STM32_EXTI_BIT(50)
#define EXTI_PRIVCFGR2_PRIV51      STM32_EXTI_BIT(51)
#define EXTI_PRIVCFGR2_PRIV52      STM32_EXTI_BIT(52)
#define EXTI_PRIVCFGR2_PRIV53      STM32_EXTI_BIT(53)
#define EXTI_PRIVCFGR2_PRIV54      STM32_EXTI_BIT(54)
#define EXTI_PRIVCFGR2_PRIV55      STM32_EXTI_BIT(55)
#define EXTI_PRIVCFGR2_PRIV56      STM32_EXTI_BIT(56)
#define EXTI_PRIVCFGR2_PRIV57      STM32_EXTI_BIT(57)
#define EXTI_PRIVCFGR2_PRIV58      STM32_EXTI_BIT(58)
#define EXTI_PRIVCFGR2_PRIV59      STM32_EXTI_BIT(59)
#define EXTI_PRIVCFGR2_PRIV60      STM32_EXTI_BIT(60)
#define EXTI_PRIVCFGR2_PRIV61      STM32_EXTI_BIT(61)
#define EXTI_PRIVCFGR2_PRIV62      STM32_EXTI_BIT(62)
#define EXTI_PRIVCFGR2_PRIV63      STM32_EXTI_BIT(63)

/* EXTI CPU wake-up with interrupt mask register 1 */

