apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_exti_m33_v1.h
#define EXTI_IMR1_IM0              STM32_EXTI_BIT(0)
#define EXTI_IMR1_IM1              STM32_EXTI_BIT(1)
#define EXTI_IMR1_IM2              STM32_EXTI_BIT(2)
#define EXTI_IMR1_IM3              STM32_EXTI_BIT(3)
#define EXTI_IMR1_IM4              STM32_EXTI_BIT(4)
#define EXTI_IMR1_IM5              STM32_EXTI_BIT(5)
#define EXTI_IMR1_IM6              STM32_EXTI_BIT(6)
#define EXTI_IMR1_IM7              STM32_EXTI_BIT(7)
#define EXTI_IMR1_IM8              STM32_EXTI_BIT(8)
#define EXTI_IMR1_IM9              STM32_EXTI_BIT(9)
#define EXTI_IMR1_IM10             STM32_EXTI_BIT(10)
#define EXTI_IMR1_IM11             STM32_EXTI_BIT(11)
#define EXTI_IMR1_IM12             STM32_EXTI_BIT(12)
#define EXTI_IMR1_IM13             STM32_EXTI_BIT(13)
#define EXTI_IMR1_IM14             STM32_EXTI_BIT(14)
#define EXTI_IMR1_IM15             STM32_EXTI_BIT(15)
#define EXTI_IMR1_IM16             STM32_EXTI_BIT(16)
#define EXTI_IMR1_IM17             STM32_EXTI_BIT(17)
#define EXTI_IMR1_IM18             STM32_EXTI_BIT(18)
#define EXTI_IMR1_IM19             STM32_EXTI_BIT(19)
#define EXTI_IMR1_IM20             STM32_EXTI_BIT(20)
#define EXTI_IMR1_IM21             STM32_EXTI_BIT(21)
#define EXTI_IMR1_IM22             STM32_EXTI_BIT(22)
#define EXTI_IMR1_IM23             STM32_EXTI_BIT(23)
#define EXTI_IMR1_IM24             STM32_EXTI_BIT(24)
#define EXTI_IMR1_IM25             STM32_EXTI_BIT(25)
#define EXTI_IMR1_IM26             STM32_EXTI_BIT(26)
#define EXTI_IMR1_IM27             STM32_EXTI_BIT(27)
#define EXTI_IMR1_IM28             STM32_EXTI_BIT(28)
#define EXTI_IMR1_IM29             STM32_EXTI_BIT(29)
#define EXTI_IMR1_IM30             STM32_EXTI_BIT(30)
#define EXTI_IMR1_IM31             STM32_EXTI_BIT(31)

/* EXTI CPU wake-up with interrupt mask register 2 */

#define EXTI_IMR2_IM32             STM32_EXTI_BIT(32)
#define EXTI_IMR2_IM33             STM32_EXTI_BIT(33)
#define EXTI_IMR2_IM34             STM32_EXTI_BIT(34)
#define EXTI_IMR2_IM35             STM32_EXTI_BIT(35)
#define EXTI_IMR2_IM36             STM32_EXTI_BIT(36)
#define EXTI_IMR2_IM37             STM32_EXTI_BIT(37)
#define EXTI_IMR2_IM38             STM32_EXTI_BIT(38)
#define EXTI_IMR2_IM39             STM32_EXTI_BIT(39)
#define EXTI_IMR2_IM40             STM32_EXTI_BIT(40)
#define EXTI_IMR2_IM41             STM32_EXTI_BIT(41)
#define EXTI_IMR2_IM42             STM32_EXTI_BIT(42)
#define EXTI_IMR2_IM43             STM32_EXTI_BIT(43)
#define EXTI_IMR2_IM44             STM32_EXTI_BIT(44)
#define EXTI_IMR2_IM45             STM32_EXTI_BIT(45)
#define EXTI_IMR2_IM46             STM32_EXTI_BIT(46)
#define EXTI_IMR2_IM47             STM32_EXTI_BIT(47)
#define EXTI_IMR2_IM48             STM32_EXTI_BIT(48)
#define EXTI_IMR2_IM49             STM32_EXTI_BIT(49)
#define EXTI_IMR2_IM50             STM32_EXTI_BIT(50)
#define EXTI_IMR2_IM51             STM32_EXTI_BIT(51)
#define EXTI_IMR2_IM52             STM32_EXTI_BIT(52)
#define EXTI_IMR2_IM53             STM32_EXTI_BIT(53)
#define EXTI_IMR2_IM54             STM32_EXTI_BIT(54)
#define EXTI_IMR2_IM55             STM32_EXTI_BIT(55)
#define EXTI_IMR2_IM56             STM32_EXTI_BIT(56)
#define EXTI_IMR2_IM57             STM32_EXTI_BIT(57)
#define EXTI_IMR2_IM58             STM32_EXTI_BIT(58)
#define EXTI_IMR2_IM59             STM32_EXTI_BIT(59)
#define EXTI_IMR2_IM60             STM32_EXTI_BIT(60)
#define EXTI_IMR2_IM61             STM32_EXTI_BIT(61)
#define EXTI_IMR2_IM62             STM32_EXTI_BIT(62)
#define EXTI_IMR2_IM63             STM32_EXTI_BIT(63)

/* EXTI CPU wake-up with event mask register 1 */

#define EXTI_EMR1_EM0              STM32_EXTI_BIT(0)
#define EXTI_EMR1_EM1              STM32_EXTI_BIT(1)
#define EXTI_EMR1_EM2              STM32_EXTI_BIT(2)
#define EXTI_EMR1_EM3              STM32_EXTI_BIT(3)
#define EXTI_EMR1_EM4              STM32_EXTI_BIT(4)
#define EXTI_EMR1_EM5              STM32_EXTI_BIT(5)
#define EXTI_EMR1_EM6              STM32_EXTI_BIT(6)
#define EXTI_EMR1_EM7              STM32_EXTI_BIT(7)
#define EXTI_EMR1_EM8              STM32_EXTI_BIT(8)
#define EXTI_EMR1_EM9              STM32_EXTI_BIT(9)
#define EXTI_EMR1_EM10             STM32_EXTI_BIT(10)
#define EXTI_EMR1_EM11             STM32_EXTI_BIT(11)
#define EXTI_EMR1_EM12             STM32_EXTI_BIT(12)
#define EXTI_EMR1_EM13             STM32_EXTI_BIT(13)
#define EXTI_EMR1_EM14             STM32_EXTI_BIT(14)
#define EXTI_EMR1_EM15             STM32_EXTI_BIT(15)
#define EXTI_EMR1_EM16             STM32_EXTI_BIT(16)
#define EXTI_EMR1_EM17             STM32_EXTI_BIT(17)
#define EXTI_EMR1_EM18             STM32_EXTI_BIT(18)
#define EXTI_EMR1_EM19             STM32_EXTI_BIT(19)
#define EXTI_EMR1_EM20             STM32_EXTI_BIT(20)
#define EXTI_EMR1_EM21             STM32_EXTI_BIT(21)
#define EXTI_EMR1_EM22             STM32_EXTI_BIT(22)
#define EXTI_EMR1_EM23             STM32_EXTI_BIT(23)
#define EXTI_EMR1_EM24             STM32_EXTI_BIT(24)
#define EXTI_EMR1_EM25             STM32_EXTI_BIT(25)
#define EXTI_EMR1_EM26             STM32_EXTI_BIT(26)
#define EXTI_EMR1_EM27             STM32_EXTI_BIT(27)
#define EXTI_EMR1_EM28             STM32_EXTI_BIT(28)
#define EXTI_EMR1_EM29             STM32_EXTI_BIT(29)
#define EXTI_EMR1_EM30             STM32_EXTI_BIT(30)
#define EXTI_EMR1_EM31             STM32_EXTI_BIT(31)

/* EXTI CPU wake-up with event mask register 2 */

#define EXTI_EMR2_EM32             STM32_EXTI_BIT(32)
#define EXTI_EMR2_EM33             STM32_EXTI_BIT(33)
#define EXTI_EMR2_EM34             STM32_EXTI_BIT(34)
#define EXTI_EMR2_EM35             STM32_EXTI_BIT(35)
#define EXTI_EMR2_EM36             STM32_EXTI_BIT(36)
#define EXTI_EMR2_EM37             STM32_EXTI_BIT(37)
#define EXTI_EMR2_EM38             STM32_EXTI_BIT(38)
#define EXTI_EMR2_EM39             STM32_EXTI_BIT(39)
#define EXTI_EMR2_EM40             STM32_EXTI_BIT(40)
#define EXTI_EMR2_EM41             STM32_EXTI_BIT(41)
#define EXTI_EMR2_EM42             STM32_EXTI_BIT(42)
#define EXTI_EMR2_EM43             STM32_EXTI_BIT(43)
#define EXTI_EMR2_EM44             STM32_EXTI_BIT(44)
#define EXTI_EMR2_EM45             STM32_EXTI_BIT(45)
#define EXTI_EMR2_EM46             STM32_EXTI_BIT(46)
#define EXTI_EMR2_EM47             STM32_EXTI_BIT(47)
#define EXTI_EMR2_EM48             STM32_EXTI_BIT(48)
#define EXTI_EMR2_EM49             STM32_EXTI_BIT(49)
#define EXTI_EMR2_EM50             STM32_EXTI_BIT(50)
#define EXTI_EMR2_EM51             STM32_EXTI_BIT(51)
#define EXTI_EMR2_EM52             STM32_EXTI_BIT(52)
#define EXTI_EMR2_EM53             STM32_EXTI_BIT(53)
#define EXTI_EMR2_EM54             STM32_EXTI_BIT(54)
#define EXTI_EMR2_EM55             STM32_EXTI_BIT(55)
#define EXTI_EMR2_EM56             STM32_EXTI_BIT(56)
#define EXTI_EMR2_EM57             STM32_EXTI_BIT(57)
#define EXTI_EMR2_EM58             STM32_EXTI_BIT(58)
#define EXTI_EMR2_EM59             STM32_EXTI_BIT(59)
#define EXTI_EMR2_EM60             STM32_EXTI_BIT(60)
#define EXTI_EMR2_EM61             STM32_EXTI_BIT(61)
#define EXTI_EMR2_EM62             STM32_EXTI_BIT(62)
#define EXTI_EMR2_EM63             STM32_EXTI_BIT(63)

/* GPIO lines 0-15 have four port selections per EXTICR, eight bits apart.
 * Clear the whole selector byte.  Valid port encodings leave any unused
 * upper bits at their reset value of zero.
 */

