apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_exti_m33_v1.h
#define STM32_EXTI_EXTICR(n)       (STM32_EXTI_EXTICR1 + (((n) >> 2) << 2))
#define EXTI_EXTICR_SHIFT(n)       (((n) & 3) << 3)
#define EXTI_EXTICR_MASK(n)        (0xffu << EXTI_EXTICR_SHIFT(n))
#define EXTI_EXTICR_PORT(n, p)     ((p) << EXTI_EXTICR_SHIFT(n))

/* EXTI external interrupt selection register 1 */

#define EXTI_EXTICR1_EXTI0_SHIFT    EXTI_EXTICR_SHIFT(0)
#define EXTI_EXTICR1_EXTI0_MASK     EXTI_EXTICR_MASK(0)
#define EXTI_EXTICR1_EXTI0(n)       EXTI_EXTICR_PORT(0, n)
#define EXTI_EXTICR1_EXTI1_SHIFT    EXTI_EXTICR_SHIFT(1)
#define EXTI_EXTICR1_EXTI1_MASK     EXTI_EXTICR_MASK(1)
#define EXTI_EXTICR1_EXTI1(n)       EXTI_EXTICR_PORT(1, n)
#define EXTI_EXTICR1_EXTI2_SHIFT    EXTI_EXTICR_SHIFT(2)
#define EXTI_EXTICR1_EXTI2_MASK     EXTI_EXTICR_MASK(2)
#define EXTI_EXTICR1_EXTI2(n)       EXTI_EXTICR_PORT(2, n)
#define EXTI_EXTICR1_EXTI3_SHIFT    EXTI_EXTICR_SHIFT(3)
#define EXTI_EXTICR1_EXTI3_MASK     EXTI_EXTICR_MASK(3)
#define EXTI_EXTICR1_EXTI3(n)       EXTI_EXTICR_PORT(3, n)

/* EXTI external interrupt selection register 2 */

#define EXTI_EXTICR2_EXTI4_SHIFT    EXTI_EXTICR_SHIFT(4)
#define EXTI_EXTICR2_EXTI4_MASK     EXTI_EXTICR_MASK(4)
#define EXTI_EXTICR2_EXTI4(n)       EXTI_EXTICR_PORT(4, n)
#define EXTI_EXTICR2_EXTI5_SHIFT    EXTI_EXTICR_SHIFT(5)
#define EXTI_EXTICR2_EXTI5_MASK     EXTI_EXTICR_MASK(5)
#define EXTI_EXTICR2_EXTI5(n)       EXTI_EXTICR_PORT(5, n)
#define EXTI_EXTICR2_EXTI6_SHIFT    EXTI_EXTICR_SHIFT(6)
#define EXTI_EXTICR2_EXTI6_MASK     EXTI_EXTICR_MASK(6)
#define EXTI_EXTICR2_EXTI6(n)       EXTI_EXTICR_PORT(6, n)
#define EXTI_EXTICR2_EXTI7_SHIFT    EXTI_EXTICR_SHIFT(7)
#define EXTI_EXTICR2_EXTI7_MASK     EXTI_EXTICR_MASK(7)
#define EXTI_EXTICR2_EXTI7(n)       EXTI_EXTICR_PORT(7, n)

/* EXTI external interrupt selection register 3 */

#define EXTI_EXTICR3_EXTI8_SHIFT    EXTI_EXTICR_SHIFT(8)
#define EXTI_EXTICR3_EXTI8_MASK     EXTI_EXTICR_MASK(8)
#define EXTI_EXTICR3_EXTI8(n)       EXTI_EXTICR_PORT(8, n)
#define EXTI_EXTICR3_EXTI9_SHIFT    EXTI_EXTICR_SHIFT(9)
#define EXTI_EXTICR3_EXTI9_MASK     EXTI_EXTICR_MASK(9)
#define EXTI_EXTICR3_EXTI9(n)       EXTI_EXTICR_PORT(9, n)
#define EXTI_EXTICR3_EXTI10_SHIFT   EXTI_EXTICR_SHIFT(10)
#define EXTI_EXTICR3_EXTI10_MASK    EXTI_EXTICR_MASK(10)
#define EXTI_EXTICR3_EXTI10(n)      EXTI_EXTICR_PORT(10, n)
#define EXTI_EXTICR3_EXTI11_SHIFT   EXTI_EXTICR_SHIFT(11)
#define EXTI_EXTICR3_EXTI11_MASK    EXTI_EXTICR_MASK(11)
#define EXTI_EXTICR3_EXTI11(n)      EXTI_EXTICR_PORT(11, n)

/* EXTI external interrupt selection register 4 */

#define EXTI_EXTICR4_EXTI12_SHIFT   EXTI_EXTICR_SHIFT(12)
#define EXTI_EXTICR4_EXTI12_MASK    EXTI_EXTICR_MASK(12)
#define EXTI_EXTICR4_EXTI12(n)      EXTI_EXTICR_PORT(12, n)
#define EXTI_EXTICR4_EXTI13_SHIFT   EXTI_EXTICR_SHIFT(13)
#define EXTI_EXTICR4_EXTI13_MASK    EXTI_EXTICR_MASK(13)
#define EXTI_EXTICR4_EXTI13(n)      EXTI_EXTICR_PORT(13, n)
#define EXTI_EXTICR4_EXTI14_SHIFT   EXTI_EXTICR_SHIFT(14)
#define EXTI_EXTICR4_EXTI14_MASK    EXTI_EXTICR_MASK(14)
#define EXTI_EXTICR4_EXTI14(n)      EXTI_EXTICR_PORT(14, n)
#define EXTI_EXTICR4_EXTI15_SHIFT   EXTI_EXTICR_SHIFT(15)
#define EXTI_EXTICR4_EXTI15_MASK    EXTI_EXTICR_MASK(15)
#define EXTI_EXTICR4_EXTI15(n)      EXTI_EXTICR_PORT(15, n)

/* EXTI lock register */

#define EXTI_LOCKR_LOCK           (1 << 0)

#endif /* __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_EXTI_M33_V1_H */
